{
  "descriptions": [
    {
      "id":       100,
      "language": "de",
      "data": [
        {
          "uid": "edu-p1",
          "component": "p",
          "text": "Teilzeitstudium in Kooperation mit IBYKUS AG."
        }
      ]
    },
    {
      "id":       100,
      "language": "en",
      "data": [
        {
          "uid": "edu-p1",
          "component": "p",
          "text": "Part-time study in collaboration with IBYKUS AG."
        }
      ]
    },
    {
      "id":       101,
      "language": "de",
      "data": [
        {
          "uid": "edu-p1",
          "component": "p",
          "text": "Duales Bachelorstudium in Kooperation mit Thales Transportation Systems GmbH."
        }
      ]
    },
    {
      "id":       101,
      "language": "en",
      "data": [
        {
          "uid": "edu-p1",
          "component": "p",
          "text": "Dual course of study in collaboration with IBYKUS AG."
        }
      ]
    },
    {
      "id":       102,
      "language": "de",
      "data": [
        {
          "uid": "edu-p1",
          "component": "p",
          "text": "Hauptfächer: Mathe, Physik"
        }
      ]
    },
    {
      "id":       102,
      "language": "en",
      "data": [
        {
          "uid": "edu-p1",
          "component": "p",
          "text": "Specialist subject: Mathematics, Physics"
        }
      ]
    },

    {
      "id":       201,
      "language": "de",
      "data": [
        {
          "uid": "career-p1",
          "component": "p",
          "text": "Entwicklung von Frontends und Geschäftslogik mit verschiedensten Technologien und Frameworks."
        }
      ]
    },
    {
      "id":       201,
      "language": "en",
      "data": [
        {
          "uid": "career-p1",
          "component": "p",
          "text": "Development of application frontends and business functionality, using various technologies and frameworks."
        }
      ]
    },

    {
      "id":       301,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Entwicklung des Arbeitszeiterfassungsprogrammes zu einem transparenten Tool für Kostenüberwachung:\n Bei dieser Arbeit beschäftigte ich mich mit dem internen Arbeitszeiterfassungsprogrammes, das mit \"Microsoft Access\" realisiert wurde. In enger Zusammenarbeit mit ausgewählten Kolleginnen und Kollegen, vereinfachte ich die Anwendung und reduzierte die benötigte Zeit für die Erfassung der Arbeitszeit."
        }
      ]
    },
    {
      "id":       301,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Further development of the used software for recording of working time, to increase the transparency and to reduce the time needed: During this task, I gained deep insights into the inhouse software used to recording the working time of the employees. The software is developed with \"Microsoft Access\". Working closely with selected colleagues, I simplified the software's graphical interface, reducing the required time to record the working time drastically."
        }
      ]
    },
    {
      "id":       302,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Erstellung eines Lastenhefts zur Neugestaltung der Reparaturen-Datenbank: Für die Bearbeitung von Reparaturen und Wartungstätigkeiten wurden verschiedene Systeme miteinander vernetzt, unter anderem SAP und Eigenentwicklungen. Meine Aufgabe im Rahmen dieser Praxisphase war es, die einzelnen Prozesse auch hinsichtlich der einzelnen Systeme sauber zu analysen. Anschließend entwickelte ich Lösungsvorschläge, die Systemlandschaft und beteiligten Prozesse zu vereinfachen."
        }
      ]
    },
    {
      "id":       302,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Composing of a technical specification to redesign the maintenance-system: To manage and record incurring maintenance tasks, several different database systems have been connected, like SAP and some inhouse databases. After some time, the different systems and there interfaces to each other became quite difficult to understand and to maintain. My task was to analyze and properly document them. Subsequently, I developed a proposal for solution to simplify the systems."
        }
      ]
    },
    {
      "id":       303,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Entwicklung und Inbetriebnahme einer Software zur Prüfeinrichtung für die Funktionsprüfung von ESTW-Relaisbaugruppen: Für die Qualitätssicherung kommen unter anderem selbst entwickelte Prüfeinrichtungen zum Einsatz. Für den Mikrocontroller einer Prüfeinrichtung entwickelte ich eine Software, um verschiedene Prüfszenarien einzulesen und die Baugruppen testweise elektrisch anzusteuern. Für die Programmierung nutzte ich die Entwicklungsumgebung \"LabVIEW\" und die Programmiersprache C."
        }
      ]
    },
    {
      "id":       303,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Development and implementation of a software for a testing device to test ESTW-relais: TTS uses plenty of inhouse developed testing devices for quality assurance and maintenance. My third task was to develop a software for the microcontroller of a testing device. I programmed the software with the development environment \"LabVIEW\" using the programming language C."
        }
      ]
    },
    {
      "id":       304,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Evaluierung der Möglichkeiten zur Anwendung der RFID-Technologie im Werk Arnstadt zur Prüfmittel- und Fertigungsmittelüberwachung: Als Vorbereitung auf meine Bachelorarbeit arbeitete ich mich in die RFID-Technologie ein. Ich analysierte den aktuellen technologischen Stand und verschiedene mögliche Einsatzszenarien innerhalb der TTS in Arnstadt."
        }
      ]
    },
    {
      "id":       304,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Analysis of possible usages for the RFID-technology to monitor production and maintenance tools: As groundwork for my bachelor thesis, I studied the RFID-technology. I analyzed the current stage of development of RFID and evaluated possible applications at the TTS."
        }
      ]
    },
    {
      "id":       305,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Entwicklung eines Basiskonzepts für optimierte Abläufe des Prüfmittelmanagements im Rahmen der technologischen und logistischen Prozesse der TTS Arnstadt. Ich entwickelte ein ganzheitliches Konzept, wie das Prüfmittelmanagement bei der TTS unter Einführung der RFID-Technologie verbessert werden kann. Dabei galt es unter anderem das Problem zu lösen, dass jedes Prüfmittel zu jeder Zeit lokalisierbar sein muss. Weiterführend sollen die Informationen und technologischen Möglichkeiten genutzt werden, um die für jede Prüfung verwendeten Prüfmittel zu dokumentieren. Letzteres ist zum Beispiel wichtig, um im Fehlerfall nachverfolgen zu können, welche Geräte mit dem fehlerhaften Prüfmittel getestet wurden."
        }
      ]
    },
    {
      "id":       305,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Development of a concept to improve the management of testing devices and tools at the TTS. Due to safety and legal reasons, the TTS has to be able to track consistently, which testing devices have been used for which specific tests. Additionally, to reduce the time needed to find required testing devices for specific steps, it should be made possible to localize all electronic testing devices. Considering different technologies to identify and to localize devices, I developed a system based on RFID."
        }
      ]
    },

    {
      "id":       401,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Entwicklung von caredo®: Die intern entwickelte Produktlösung caredo® ermöglicht u. a. die elektronische Abbildung von Dokumenten und Vorgängen. Die Logik ist mit in Java/JEE programmiert. Für die Darstellung der Weboberflächen wird Eclipse RAP und HTML/CSS verwendet."
        }
      ]
    },
    {
      "id":       401,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Development of caredo®: With the product-solution caredo® it is possible to digitally transform paper-based documents and business. The logic is programmed with Java/JEE. The web-frontends are realized with Eclipse RAP and HTML/CSS."
        }
      ]
    },
    {
      "id":       402,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Excel-AddIn zum Importieren von Excel-Dateien in caredo®-Anwendungen: Die für caredo®-Anwendungen notwendigen Konfigurationen können von den Kunden in Microsoft Excel erstellt werden. Meine Aufgabe war die Entwicklung eines AddIns, mit dem die Konfigurationsdaten aus den Excel-Dateien in die Anwendung importiert werden können."
        }
      ]
    },
    {
      "id":       402,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Excel-AddIn to import Excel-Files into caredo®-applications: The configuration data for caredo®-applications can be written with Microsoft Excel. Customers, like government agencies can manage them on their own. My task was to develop an Excel-AddIn to facilitate importing the configuration data into the application."
        }
      ]
    },
    {
      "id":       403,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Untersuchung der Barrierefreiheit von mit caredo® entwickelten Fachanwendungen: Für eine exemplarisch ausgewählte Fachanwendung auf Basis von caredo® habe ich die Barrierefreiheit untersucht. Im engen Dialog mit den Entwicklern wurden Lösungsvorschläge zum Verringern der Barrieren erarbeitet."
        }
      ]
    },
    {
      "id":       403,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Analyzation of the accessibility of applications developed with caredo®: I analyzed the acessibility of one application that was developed with caredo®. In close dialogs with the developers we improved the accessibility of caredo®-applications greatly."
        }
      ]
    },
    {
      "id":       404,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Entwicklung von Fachanwendungen mit IBYKUS AP®: Mit dem firmeneigenen Framework IBYKUS AP® können dokumentenbasierte Clientanwendungen schnell entwickelt werden. Die Programmierung der Anwendungen basiert auf Oracle PL/SQL und die Konfiguration auf XML-Dateien."
        }
      ]
    },
    {
      "id":       404,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Development of applications with IBYKUS AP®: The inhouse developed application framework IBYKUS AP® enables to rapidly develop client-applications based on documents. The used programming language is Oracle PL/SQL and the configuration is written in XML."
        }
      ]
    },
    {
      "id":       405,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Anpassungsfähiges Layout für IBYKUS AP®/WebGate-Anwendungen: IBYKUS AP®/WebGate-Anwendungen können mit Web-Browsern bedient werden. Im engen Kontakt mit Web-Designern entwickelten wir die Darstellung des Frontend weiter, sodass es auch mit Tablets und Smartphones zugänglich ist."
        }
      ]
    },
    {
      "id":       405,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Responsive design for IBYKUS AP®/WebGate-Applications: IBYKUS AP®/WebGate-applications can be used with common web browsers. In close dialogs with web-designers, we implemented a modern, responsive design that can be used with tablets and smartphones, too."
        }
      ]
    },
    {
      "id":       406,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Entwicklung einer Anwendung zum Konfigurieren von anpassungsfähigen Layouts für IBYKUS AP®/WebGate-Anwendungen: Zum Konfigurieren der anpassungsfähigen Layouts für IBYKUS AP®/WebGate-Anwendungen konnte die bestehende Clientanwendung nicht weiterverwendet werden. Deshalb entwickelte ich auf Basis von Electron und React eine neue Anwendung dafür."
        }
      ]
    },
    {
      "id":       406,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Development of an application to configure responsive designs for IBYKUS AP®/WebGate-Applications: IBYKUS AP® provides a client-software to configure form layouts. The existing client-software could not been reused to configure the form-layouts for the responsive design of IBYKUS AP®/WebGate-applications. Instead, I developed a new application based on Electron and React."
        }
      ]
    },
    {
      "id":       407,
      "language": "de",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Entwicklung eines Frontends mit React: Um auch zukünftig moderne Anwendungen anbieten zu können, hat sich IBYKUS für einen neuen Technologiestack auf Basis von .NET (Backend) und React (Frontend) entschieden. Bei der Entwicklung der ersten komplexeren Kundenanwendung war ich für das Frontend zuständig."
        }
      ]
    },
    {
      "id":       407,
      "language": "en",
      "data": [
        {
          "uid": "task-span1",
          "component": "span",
          "text": "Development of a frontend with React: To be able to offer modern application solutions, IBYKUS decided to develop future applications with .NET (backend) and React (frontend). For the first application I was responsible to develop the frontend."
        }
      ]
    }
  ]
}
