{
  "features": [
    {
      "id":       1,
      "language": "de",
      "title":    "leisure:playing guitar",
      "image":    "Leisure-Guitar.jpg",
      "data": [
        {
          "uid": "leisure-guitar-h1",
          "component": "h",
          "text": "Gitarre spielen",
          "variant": "h3"
        },
        {
          "uid": "leisure-guitar-p1",
          "component": "p",
          "text": "Als Ausgleich zur Arbeit am Computer spiele ich Western-Gitarre mit bevorzugt rockigen Liedern meiner Lieblingsbands."
        },
        {
          "uid": "leisure-guitar-p2",
          "component": "p",
          "text": "Angefangen habe ich mit einem privaten Gitarrenlehrer. Inzwischen lerne ich autodidaktisch weiter. Das selbstständige Lernen hat für mich viele Vorteile:"
        },
        {
          "uid": "leisure-guitar-list1",
          "component": "ul",
          "children": [
            {
              "uid": "leisure-guitar-list1-item1",
              "component": "li",
              "text": "Ich bin zeitlich unabhängig und kann in meinem eigenen Tempo lernen."
            },
            {
              "uid": "leisure-guitar-list1-item2",
              "component": "li",
              "text": "Ich bin räumlich ungebunden und spare mir das Pendeln zum Lehrer."
            },
            {
              "uid": "leisure-guitar-list1-item3",
              "component": "li",
              "text": "Ich kann die Lieder spielen, die mir Spaß machen. Beim Aussuchen lernt man sehr schnell, wo man steht und was noch fehlt. :-)"
            }
          ]
        },
        {
          "uid": "leisure-guitar-p3",
          "component": "p",
          "text": "Und welche Lieder spiele ich so? Naja... die, die ich auch gerne höre! Also Lieder von Red Hot Chili Peppers, Sum 41, Linkin Park ... 🤘"
        }
      ]
    },
    {
      "id":       1,
      "language": "en",
      "title":    "leisure:playing guitar",
      "image":    "Leisure-Guitar.jpg",
      "data": [
        {
          "uid": "leisure-guitar-h1",
          "component": "h",
          "text": "Playing Guitar",
          "variant": "h3"
        },
        {
          "uid": "leisure-guitar-p1",
          "component": "p",
          "text": "As recreation to all the computer work, I like to play \"rocky\" songs on my western-guitar."
        },
        {
          "uid": "leisure-guitar-p2",
          "component": "p",
          "text": "I started to learn playing guitar with a private teacher. By now, I continue to learn it autodidactic. For me, learning by doing on my own has many upsides:"
        },
        {
          "uid": "leisure-guitar-list1",
          "component": "ul",
          "children": [
            {
              "uid": "leisure-guitar-list1-item1",
              "component": "li",
              "text": "I am not bound to time and can learn at my pace."
            },
            {
              "uid": "leisure-guitar-list1-item2",
              "component": "li",
              "text": "There is no need to go to the teacher's location first. I can start immediately and use my time efficiently."
            },
            {
              "uid": "leisure-guitar-list1-item3",
              "component": "li",
              "text": "And most importantly: I can play those songs, that I really enjoy. And when searching for new songs, I can better understand my current skill level. :-)"
            }
          ]
        },
        {
          "uid": "leisure-guitar-p3",
          "component": "p",
          "text": "And what songs do I play? Well... the songs that I love to listen to, of course! Songs of Red Hot Chili Peppers, Sum 41, Linkin Park ... 🤘"
        }
      ]
    },
    {
      "id":       2,
      "language": "de",
      "title":    "leisure:photography",
      "image":    "Leisure-Photography.jpg",
      "data": [
        {
          "uid": "leisure-photography-h1",
          "component": "h",
          "text": "Fotografieren",
          "variant": "h3"
        },
        {
          "uid": "leisure-photography-p1",
          "component": "p",
          "text": "Jedes Jahr erstellen meine Freundin und ich ein \"Jahresalbum\" über das vergangene Jahr. Jedes Album umfasst ca. 100 ausgewählte Fotos, die unsere besondersten und einprägensten Erlebnisse festhalten."
        },
        {
          "uid": "leisure-photography-p2",
          "component": "p",
          "text": "Dadurch hat sich eine große Leidenschaft für die Fotografie entwickelt. Neben der \"Ereignisfotografie\", also das Fotografieren zu Events und Treffen, verbringen wir inzwischen viel Zeit im Freien bei der Landschafts- und Makrofotografie."
        },
        {
          "uid": "leisure-photography-p3",
          "component": "p",
          "text": "Nebenher wächst natürlich auch das Equipment: Aktuell fotografieren wir mit der spiegellosen Systekamera \"Sony α6300\". Mein \"immer-drauf\"-Objekt ist das \"Sony 35mm\". Für besondere Umstände kommen aber auch das \"Zeiss 12mm\", das \"Sony 18-135mm\" oder das \"Sony G 135mm\" zum Einsatz."
        },
        {
          "uid": "leisure-photography-p4",
          "component": "p",
          "text": "Nachbearbeitet werden die Fotos mit RawTherapee und Gimp."
        },
        {
          "uid": "leisure-photography-img1",
          "component": "img",
          "image": "Leisure-RaspberryPi.jpg"
        }
      ]
    },
    {
      "id":       2,
      "language": "en",
      "title":    "leisure:photography",
      "image":    "Leisure-Photography.jpg",
      "data": [
        {
          "uid": "leisure-photography-h1",
          "component": "h",
          "text": "Photography",
          "variant": "h3"
        },
        {
          "uid": "leisure-photography-p1",
          "component": "p",
          "text": "Every year, together my girlfriend and I create a photo album about the past year. Each album includes about 100 photos that record our most memorable and important events."
        },
        {
          "uid": "leisure-photography-p2",
          "component": "p",
          "text": "Thereby we have developed a strong passion to the photography itself. Additionally to the \"event-photography\", we spend a fair amount of our spare time in nature with the landscape- and macro-photography."
        },
        {
          "uid": "leisure-photography-p3",
          "component": "p",
          "text": "Alongside comes a grow of our used equipment: Currently, we are using the system camera \"Sony α6300\". My personal \"always on\"-objective is the \"Sony 35mm\". But for particular situations we also use the \"Zeiss 12mm\", the \"Sony 18-135mm\" or the \"Sony G 135mm\"."
        },
        {
          "uid": "leisure-photography-p4",
          "component": "p",
          "text": "The post-processing is done with RawTherapee and Gimp."
        },
        {
          "uid": "leisure-photography-img1",
          "component": "img",
          "image": "Leisure-RaspberryPi.jpg"
        }
      ]
    },
    {
      "id":       3,
      "language": "de",
      "title":    "leisure:raspberry pi",
      "image":    "Leisure-RaspberryPi.jpg",
      "data": [
        {
          "uid": "leisure-raspberrypi-h1",
          "component": "h",
          "text": "Bastelcomputer",
          "variant": "h3"
        },
        {
          "uid": "leisure-raspberrypi-p1",
          "component": "p",
          "text": "Was Datenschutz angeht, bin ich eventuell etwas paranoid. Private Daten in einer Dropbox oder ähnliches abzulegen und zu teilen, kommt für mich nicht in Frage."
        },
        {
          "uid": "leisure-raspberrypi-p2",
          "component": "p",
          "text": "Um diese Lücke zu füllen, habe ich meinen eigenen kleinen Heimserver mit einem \"Raspberry Pi\" realisiert. Auf dem kleinen Bastelrechner laufen aktuell folgende Dienste:"
        },
        {
          "uid": "leisure-raspberrypi-list1",
          "component": "ul",
          "children": [
            {
              "uid": "leisure-raspberrypi-list1-item1",
              "component": "li",
              "text": "Das Betriebssystem \"Raspbian\", das auf Linux aufbaut."
            },
            {
              "uid": "leisure-raspberrypi-list1-item2",
              "component": "li",
              "text": "Die Firewall \"nftables\", um Angreifern die Übernahme zu erschweren. Ausschließlich Verbindungen aus Deutschland werden erlaubt. Zeitweise hatte ich es sogar auf meine IP-Adressen beschränkt."
            },
            {
              "uid": "leisure-raspberrypi-list1-item3",
              "component": "li",
              "text": "Der DNS-Server \"unbound\", über den mein gesamter Internet-Verkehr verläuft. Die DNS-Anfragen werden automatisch mit TLS verschlüsselt und Werbung gefiltert."
            },
            {
              "uid": "leisure-raspberrypi-list1-item4",
              "component": "li",
              "text": "Der Voice-Chat \"mumble\", über den meine Freunde und ich kommunizieren."
            },
            {
              "uid": "leisure-raspberrypi-list1-item5",
              "component": "li",
              "text": "Die Dateicloud \"Seafile\", über die meine Freunde und ich Dateien austauschen, wie Kochrezepte, Fotos, Anleitungen usw."
            }
          ]
        },
        {
          "uid": "leisure-raspberrypi-p3",
          "component": "p",
          "text": "Früher hatte ich auch noch \"gitea\" als Git-Service installiert, um meine privaten Projekte zu versionieren und teilen zu können. Inzwischen habe ich aber alle Projekte auf GitHub umgezogen, um deren Sichtbarkeit zu erhöhen."
        }
      ]
    },
    {
      "id":       3,
      "language": "en",
      "title":    "leisure:raspberry pi",
      "image":    "Leisure-RaspberryPi.jpg",
      "data": [
        {
          "uid": "leisure-raspberrypi-h1",
          "component": "h",
          "text": "Raspberry Pi",
          "variant": "h3"
        },
        {
          "uid": "leisure-raspberrypi-p1",
          "component": "p",
          "text": "Privacy is very important to me. I wouldn't store or share private data via Dropbox or other public cloud services."
        },
        {
          "uid": "leisure-raspberrypi-p2",
          "component": "p",
          "text": "To share files with friends, I have set up my own home cloud with a \"Raspberry Pi\". It provides the following services:"
        },
        {
          "uid": "leisure-raspberrypi-list1",
          "component": "ul",
          "children": [
            {
              "uid": "leisure-raspberrypi-list1-item1",
              "component": "li",
              "text": "It runs the operation system \"Raspbian\", that is built upon Linux."
            },
            {
              "uid": "leisure-raspberrypi-list1-item2",
              "component": "li",
              "text": "The firewall \"nftables\" impedes attacks from the Internet. Only connections from Germany are permitted. In the past, I had only permitted connections from specific IPs. But that was too cumbersome, if friends with changing IPs tried to access a service."
            },
            {
              "uid": "leisure-raspberrypi-list1-item3",
              "component": "li",
              "text": "The DNS-service \"unbound\" tunnels all queries to the Internet. The queries are automatically encrypted with TLS and advertisement is filtered off."
            },
            {
              "uid": "leisure-raspberrypi-list1-item4",
              "component": "li",
              "text": "The voice-chat \"mumble\" is used for talking."
            },
            {
              "uid": "leisure-raspberrypi-list1-item5",
              "component": "li",
              "text": "The file-cloud \"Seafile\" is used to share files with friends, like cooking receipts, photos, instructions and more."
            }
          ]
        },
        {
          "uid": "leisure-raspberrypi-p3",
          "component": "p",
          "text": "In the past, it was also running \"gitea\" as git-service to put my private software projects under version control and to share them. By now, all my projects have been migrated to GitHub to make them public for all."
        }
      ]
    },
    {
      "id":       4,
      "language": "de",
      "title":    "leisure:software games development open source",
      "image":    "Leisure-GamesDevelopment.png",
      "data": [
        {
          "uid": "leisure-gamesdevelopment-h1",
          "component": "h",
          "text": "Spieleentwicklung",
          "variant": "h3"
        },
        {
          "uid": "leisure-gamesdevelopment-p1",
          "component": "p",
          "text": "Meine Leidenschaft für die Programmierung erweckte das Open Source-Computerspiel \"Teeworlds\" als ich 16 Jahre jung war. Um den Worms-ähnliche 2D-Shooter bildete sich eine aktive Modding-Community. Modding bezeichnet die Modifizierung von etwas, in dem Falle des Spieles selbst."
        },
        {
          "uid": "leisure-gamesdevelopment-p2",
          "component": "p",
          "text": "Auch ich hatte viele Ideen, das Spiel zu verbessern und zu verändern. Dadurch kam ich mit den Programmiersprachen C und C++ in Berührung. Insbesondere die Hacks rund um die Pointer hatten mich fasziniert - so viel Optimierungspotenzial!"
        },
        {
          "uid": "leisure-gamesdevelopment-p3",
          "component": "p",
          "text": "Über die Modding-Community kam ich immer häufiger mit dem offiziellen Programmierteam von Teeworlds in Berührung, wobei ich nie meine Verbindung zu der Modding-Community und den Spielern verlierte. Im Professionellen würde man diese Stelle wohl \"Support\" bezeichnen. Ich griff die Probleme und Ideen der Spieler auf und kommunizierte bzw. diskutierte sie mit dem Entwicklerteam. Im Spieleforum agierte ich als offizielles \"Support-Staff\" und unterstützte die Spieler bei technischen Problemen."
        },
        {
          "uid": "leisure-gamesdevelopment-p4",
          "component": "p",
          "text": "Durch mein Engagement bei Teeworlds habe ich es verstanden, Leuten zuzuhören und ihre Kernprobleme zu verstehen. Ich bin befähigt, diese Probleme für die \"Techis\" aufzubereiten und daraus ein rundes Produkt zu entwickeln."
        }
      ]
    },
    {
      "id":       4,
      "language": "en",
      "title":    "leisure:software games development open source",
      "image":    "Leisure-GamesDevelopment.png",
      "data": [
        {
          "uid": "leisure-gamesdevelopment-h1",
          "component": "h",
          "text": "Games Development",
          "variant": "h3"
        },
        {
          "uid": "leisure-gamesdevelopment-p1",
          "component": "p",
          "text": "My passion to the software development was created at an age of 16 by the open source computer game \"Teeworlds\". The Worms-like 2D-Shooter had a very active modding-community. The term \"modding\" means the modification of something, in this case of the game itself."
        },
        {
          "uid": "leisure-gamesdevelopment-p2",
          "component": "p",
          "text": "I had many great ideas to change and enhance the game, too. Doing so, I came in touch with the programming languages C and C++. Especially the hacks with the C-pointers fascinated me. So many possibilities to optimize things!"
        },
        {
          "uid": "leisure-gamesdevelopment-p3",
          "component": "p",
          "text": "Through the modding-community, I got frequently in touch with the official development-team of Teeworlds, whereupon I never lost my connection to the modding-community and the gamers. I picked up the issues and ideas of the community and discussed them with the development-team. As \"Support-Staff\" of the official game's forum I helped the players with their technical problems."
        },
        {
          "uid": "leisure-gamesdevelopment-p4",
          "component": "p",
          "text": "As result to my engagement I have learned to carefully listen to people and to understand their core problems. I am competent to translate their problems into the development-language for the programmers and to design a well-elaborated product that provides an excellent user-experience."
        }
      ]
    },


    {
      "id":       100,
      "language": "de",
      "title":    "education:master graduation",
      "image":    "Education-Uas-Erfurt.png",
      "data": [
        {
          "uid": "education-mastergraduation-h1",
          "component": "h",
          "text": "Angewandte Informatik an der Fachhochschule Erfurt",
          "variant": "h3"
        },
        {
          "uid": "education-mastergraduation-p1",
          "component": "p",
          "text": "Direkt an mein Bachelorstudium anschließend habe ich mein Masterstudium in Angewandte Informatik (M. Sc.) begonnen. Leider konnte ich das Duale Studium dafür nicht fortsetzen. Aufgrund der Nähe zu meinem Heimatort wählte ich die Fachhochschule Erfurt."
        },
        {
          "uid": "education-mastergraduation-p2",
          "component": "p",
          "text": "Das Studium an der Fachhochschule Erfurt ist teamorientiert und praxisnah. Bei diversen Projekten und Teamarbeiten lernte ich tiefergehendes Wissen über die Softwareentwicklung, Big Data und Computertechnik. Daneben wurden mir wichtige Inhalte zu Betriebswirtschaftslehre, Projektmanagement, Mathematik und vieles mehr vermittelt."
        },
        {
          "uid": "education-mastergraduation-p3",
          "component": "p",
          "text": "Weil ich auch weiterhin mein erlerntes Wissen praktisch anwenden wollte, studierte ich im Teilzeitmodell mit der IBYKUS AG für Informationstechnologie zusammen. Die IBYKUS AG ist ein mittelständisches Unternehmen in Erfurt und bietet IT-Dienstleistungen an, wie Softwareentwicklung und Hosting."
        }
      ]
    },
    {
      "id":       100,
      "language": "en",
      "title":    "education:master graduation",
      "image":    "Education-Uas-Erfurt.png",
      "data": [
        {
          "uid": "education-bachelorgraduation-h1",
          "component": "h",
          "text": "Studying Applied Computer Science at the University of Applied Science Erfurt",
          "variant": "h3"
        },
        {
          "uid": "education-mastergraduation-p1",
          "component": "p",
          "text": "Right after my bachelor studies, I started studying Applied Computer Science (M. Sc.). Unfortunatly, it wasn't possible to continue it as Dual Course of Study. Mainly because of the close distance to my hometown, I chose the University of Applied Science Erfurt for my master studies."
        },
        {
          "uid": "education-mastergraduation-p2",
          "component": "p",
          "text": "The studies at the University of Applied Science Erfurt are team oriented and practical. Doing many team projects, I learned profound knowledge about software development, big data and computer science. Additionally, I got taught in business economics, project management, mathematics and much more."
        },
        {
          "uid": "education-mastergraduation-p3",
          "component": "p",
          "text": "During my bachelor studies, I enjoyed the practical phases most. Mainly, because I prefer to develop useful software over solving simple, academical problems. Therefore, I wanted to continue working besides my studies. I decided to study part-time, and to work at \"IBYKUS AG für Informationstechnologie\". IBYKUS AG is a medium-sizes enterprise headquartered in Erfurt. They offer various services for IT, like software development and hosting."
        }
      ]
    },
    {
      "id":       101,
      "language": "de",
      "title":    "education:bachelor graduation",
      "image":    "Education-Uce_Gera.jpg",
      "data": [
        {
          "uid": "education-bachelorgraduation-h1",
          "component": "h",
          "text": "Praktische Informatik an der Berufsakademie Gera",
          "variant": "h3"
        },
        {
          "uid": "education-bachelorgraduation-p1",
          "component": "p",
          "text": "Meinen Bachelorabschluss in Praktische Informatik (B. Ing.) habe ich an der Berufsakademie in Gera erworben. Als Ausbildungspartner für das duale Studium wählte ich die Thales Transportation Systems GmbH, Standort Arnstadt (TTS)."
        },
        {
          "uid": "education-bachelorgraduation-p4",
          "component": "p",
          "text": "Während der Theoriephasen an der Berufsakademie wurden mir viele Grundlagen der praktischen Informatik vermittelt, wie die Programmiersprachen C und Java sowie HTML und CSS. Darüber hinaus erhielt ich Einblicke in Betriebssysteme, wie Windows, Linux und Microsoft Server. Fächer wie \"Business Englisch\", Recht und Betriebswirtschaftslehre rundeten das Studium ab."
        },
        {
          "uid": "education-bachelorgraduation-p5",
          "component": "p",
          "text": "Meine Bachelorarbeit knüpfte an meine letzte Praxisarbeit an und trägt den Titel: Entwicklung eines Basiskonzepts für optimierte Abläufe des Prüfmittelmanagements im Rahmen der technologischen und logistischen Prozesse der TTS Arnstadt. Ich entwickelte ein ganzheitliches Konzept, wie das Prüfmittelmanagement bei der TTS unter Einführung der RFID-Technologie verbessert werden kann. Dabei galt es unter anderem das Problem zu lösen, dass jedes Prüfmittel zu jeder Zeit lokalisierbar sein muss. Weiterführend sollen die Informationen und technologischen Möglichkeiten genutzt werden, um die für jede Prüfung verwendeten Prüfmittel zu dokumentieren. Letzteres ist zum Beispiel wichtig, um im Fehlerfall nachverfolgen zu können, welche Geräte mit dem fehlerhaften Prüfmittel getestet wurden."
        }
      ]
    },
    {
      "id":       101,
      "language": "en",
      "title":    "education:bachelor graduation",
      "image":    "Education-Uce_Gera.jpg",
      "data": [
        {
          "uid": "education-mastergraduation-h1",
          "component": "h",
          "text": "Studying Practical Computer Science at the University of Cooperative Education Gera",
          "variant": "h3"
        },
        {
          "uid": "education-bachelorgraduation-p1",
          "component": "p",
          "text": "I've acquired my bachelor degree in Practical Computer Science (B. Eng.) at the University of Cooperative Education Gera. To get first insights into the business world, I chose a Dual Course of Study together with Thales Transportation Systems GmbH, at the site Arnstadt (TTS)."
        },
        {
          "uid": "education-bachelorgraduation-p4",
          "component": "p",
          "text": "During my studies at the University, I learned plenty about informatics, like about the programming languages C and Java, and about HTML and CSS. Furthermore, I gained deep insights into computer operation systems, like Windows, Linux and Microsoft Server. Additionally, I got taught in business English, law, business economics and more."
        },
        {
          "uid": "education-bachelorgraduation-p5",
          "component": "p",
          "text": "My bachelor thesis continues the work of my latest practical task: Development of a concept to improve the management of testing devices and tools at the TTS. Due to safety and legal reasons, the TTS has to be able to track consistently, which testing devices have been used for which specific tests. Additionally, to reduce the time needed to find required testing devices for specific steps, it should be made possible to localize all electronic testing devices. Considering different technologies to identify and to localize devices, I developed a system based on RFID."
        }
      ]
    },
    {
      "id":       102,
      "language": "de",
      "title":    "education:A-level",
      "image":    "Education-Highschool_Arnstadt.jpg",
      "data": [
        {
          "uid": "education-alevel-h1",
          "component": "h",
          "text": "Allgemeine Hochschulreife am Staatlichen Gymnasium Melissantes",
          "variant": "h3"
        },
        {
          "uid": "education-alevel-p1",
          "component": "p",
          "text": "Meine allgemeine Hochschulreife habe ich am Staatlichen Gymnasium Melissantes in Arnstadt erworben. Als Fächer mit erhöhtem Anforderungsniveau (neu-deutsch für \"Leistungsfächer\") wählte ich Mathematik und Physik. Weitere Neigungsfächer waren Informatik sowie Wirtschaft und Recht."
        },
        {
          "uid": "education-alevel-p2",
          "component": "p",
          "text": "In meiner Freizeit spielte ich im Verein Handball. Die restliche Zeit verbrachte ich überwiegend am Computer. Neben dem Spielen von Computerspielen faszinierte mich auch die Programmierung dahinter, wodurch meine Leidenschaft für die Informatik geweckt wurde."
        }
      ]
    },
    {
      "id":       102,
      "language": "en",
      "title":    "education:A-level",
      "image":    "Education-Highschool_Arnstadt.jpg",
      "data": [
        {
          "uid": "education-alevel-h1",
          "component": "h",
          "text": "Qualifying for A-level at the Governmental High School of Melissantes",
          "variant": "h3"
        },
        {
          "uid": "education-alevel-p1",
          "component": "p",
          "text": "I've acquired my qualification for A-level at the Governmental High School of Melissantes in Arnstadt. As main subjects I picked mathematics and physics. Further favorite subjects were informatics as well as economy and law."
        },
        {
          "uid": "education-alevel-p2",
          "component": "p",
          "text": "In my sparetime I'd played handball in a club. The remaining time I'd used for computer related activities. Although I enjoy playing computer games, I was also fascinated by the programming of games. That evoked my passion for the informatics even more."
        }
      ]
    },

    {
      "id":       200,
      "language": "de",
      "title":    "career:dual course of study",
      "image":    "Career-Thales.jpg",
      "data": [
        {
          "uid": "career-h1",
          "component": "h",
          "text": "Praktische Informatik bei Thales Transportation Systems GmbH, Arnstadt",
          "variant": "h3"
        },
        {
          "uid": "career-p1",
          "component": "p",
          "text": "Als Ausbildungspartner für das duale Studium wählte ich die Thales Transportation Systems GmbH, Standort Arnstadt (TTS). Die TTS gehört dem Industriesektor an und produziert überwiegend elektronische Geräte und Zubehör für den Schienennah- und Fernverkehr, wie zum Beispiel Weichenanlagen und Signalschirme. Die unterschiedlichen Produkte durchlaufen bei der TTS den kompletten Lebenszyklus, inklusive Konzipierung, Produktion, Wartung und Verschrottung."
        }
      ]
    },
    {
      "id":       200,
      "language": "en",
      "title":    "career:dual course of study",
      "image":    "Career-Thales.jpg",
      "data": [
        {
          "uid": "career-h1",
          "component": "h",
          "text": "Studying Practical Computer Science with Thales Transportation Systems GmbH, Arnstadt",
          "variant": "h3"
        },
        {
          "uid": "career-p1",
          "component": "p",
          "text": "To get first insights into the business world, I chose a Dual Course of Study together with Thales Transportation Systems GmbH, at the site Arnstadt (TTS). TTS predominantly produces electronical machines and tools for railroads, like switch points and signal lamps. TTS covers the whole product life-cycle, from conceptual design, production, maintenance to scrapping."
        }
      ]
    },
    {
      "id":       201,
      "language": "de",
      "title":    "career:software developer",
      "image":    "Career-Ibykus.jpg",
      "data": [
        {
          "uid": "career-h1",
          "component": "h",
          "text": "Softwareentwickler bei IBYKUS AG für Informationstechnologie",
          "variant": "h3"
        },
        {
          "uid": "career-p1",
          "component": "p",
          "text": "Mit meinem Masterstudium habe ich eine Stelle als Softwarerentwickler bei IBYKUS AG für Informationstechnologie in Teilzeit angetreten. Die IBYKUS AG ist ein mittelständisches Unternehmen in Erfurt und bietet IT-Dienstleistungen an, wie Softwareentwicklung und Hosting."
        },
        {
          "uid": "career-p2",
          "component": "p",
          "text": "Seit dem Abschluss meines Studiums arbeite ich bei IBYKUS AG in Vollzeit. Ich bin inzwischen zusätzlich für den Kundensupport in meinem Team verantwortlich. Außerdem bin ich Kernkompetenzträger für die Entwicklung von Frontends mit React und für Problemstellungen rund um Barrierefreiheit und Anpassungsfähiges Layout."
        }
      ]
    },
    {
      "id":       201,
      "language": "en",
      "title":    "career:software developer",
      "image":    "Career-Ibykus.jpg",
      "data": [
        {
          "uid": "career-h1",
          "component": "h",
          "text": "Software Developer at \"IBYKUS AG für Informationstechnologie\"",
          "variant": "h3"
        },
        {
          "uid": "career-p1",
          "component": "p",
          "text": "Simultaneous to my master studies, I started working at \"IBYKUS AG für Informationstechnologie\" as software developer. IBYKUS AG is a medium-sizes enterprise headquartered in Erfurt. They offer various services for IT, like software development and hosting."
        },
        {
          "uid": "career-p2",
          "component": "p",
          "text": "Since my graduation, I work at IBYKUS AG full-time. By now, I am responsible for the customer support for my team. Furthermore I am key personel for the development of frontends with React and for topics about accessibility and responsive design."
        }
      ]
    },

    {
      "id":       301,
      "language": "de",
      "title":    "task:development of software for recording of working time",
      "image":    "Education-Highschool_Arnstadt.jpg",
      "data": [
        {
          "uid": "task-h1",
          "component": "h",
          "text": "Microsoft Access Datenbank",
          "variant": "h3"
        }
      ]
    },
    {
      "id":       301,
      "language": "en",
      "title":    "task:development of software for recording of working time",
      "image":    "Education-Highschool_Arnstadt.jpg",
      "data": [
        {
          "uid": "task-h1",
          "component": "h",
          "text": "Microsoft Access Database",
          "variant": "h3"
        }
      ]
    }
  ]
}
